lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static bool enqueue_ble_legacy_adv_event(uint8_t channel_mask,
                                         uint32_t event_count,
                                         uint32_t heartbeat,
                                         uint32_t random_delay_ticks) {
  if (g_ble_legacy_adv_event_queue_count >= VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH) {
    g_ble_legacy_adv_event_drop_count = g_ble_legacy_adv_event_drop_count + 1U;
    return false;
  }
  vpr_ble_legacy_adv_event_entry_t *entry =
      &g_ble_legacy_adv_event_queue[g_ble_legacy_adv_event_queue_tail];
  entry->flags = random_delay_ticks != 0U ? 0x01U : 0x00U;
  entry->channelMask = channel_mask;
  entry->eventCount = event_count;
  entry->heartbeat = heartbeat;
  entry->randomDelayTicks = random_delay_ticks;
  g_ble_legacy_adv_event_sequence = g_ble_legacy_adv_event_sequence + 1U;
  entry->sequence = g_ble_legacy_adv_event_sequence;
  g_ble_legacy_adv_event_queue_tail =
      (g_ble_legacy_adv_event_queue_tail + 1U) % VPR_BLE_LEGACY_ADV_EVENT_QUEUE_DEPTH;
  g_ble_legacy_adv_event_queue_count = g_ble_legacy_adv_event_queue_count + 1U;
  return true;
}

static void clear_ble_connection_event_queue(void) {
  bytes_zero(g_ble_connection_event_queue, sizeof(g_ble_connection_event_queue));
  g_ble_connection_event_queue_head = 0U;
  g_ble_connection_event_queue_tail = 0U;
  g_ble_connection_event_queue_count = 0U;
}

static bool enqueue_ble_connection_event(uint8_t flags,
                                         uint8_t reason) {
  if (g_ble_connection_event_queue_count >= VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH) {
    g_ble_connection_event_drop_count = g_ble_connection_event_drop_count + 1U;
    return false;
  }
  vpr_ble_connection_event_entry_t *entry =
      &g_ble_connection_event_queue[g_ble_connection_event_queue_tail];
  entry->flags = flags;
  entry->reason = reason;
  entry->connHandle = g_ble_connection_conn_handle;
  entry->role = g_ble_connection_role;
  entry->encrypted = g_ble_connection_encrypted;
  entry->intervalUnits = g_ble_connection_interval_units;
  entry->latency = g_ble_connection_latency;
  entry->supervisionTimeout = g_ble_connection_supervision_timeout;
  entry->txPhy = g_ble_connection_tx_phy;
  entry->rxPhy = g_ble_connection_rx_phy;
  entry->eventCount = g_ble_connection_event_count;
  entry->disconnectCount = g_ble_connection_disconnect_count;
  g_ble_connection_last_event_flags = flags;
  g_ble_connection_last_disconnect_reason = reason;
  g_ble_connection_event_sequence = g_ble_connection_event_sequence + 1U;
  entry->sequence = g_ble_connection_event_sequence;
  g_ble_connection_event_queue_tail =
      (g_ble_connection_event_queue_tail + 1U) % VPR_BLE_CONNECTION_EVENT_QUEUE_DEPTH;
  g_ble_connection_event_queue_count = g_ble_connection_event_queue_count + 1U;
  return true;
}

static uint8_t ble_cs_link_runnable(void) {
  return (uint8_t)((g_ble_cs_link_bound != 0U && g_ble_connection_connected != 0U &&
                    g_ble_connection_conn_handle != 0U &&
                    g_ble_connection_encrypted != 0U)
                       ? 1U
                       : 0U);
}

static uint32_t fnv1a32_bytes(const uint8_t *data, size_t len);
static void reset_ble_cs_workflow_runtime_state(bool clear_summary);
static uint8_t current_demo_antenna_permutation(uint8_t step_index);
static void append_mode2_sample_step(uint8_t *dst, uint8_t channel, uint8_t permutation_index,
                                     uint8_t quality, const uint8_t pct[3]);
static size_t append_mode1_unavailable_step(uint8_t *dst, uint8_t channel,
                                            uint8_t packet_antenna);
static void cache_ble_cs_workflow_completed_results(void);

static void clear_ble_cs_workflow_state(void) {
  g_ble_cs_workflow_defaults_applied = 0U;
  g_ble_cs_workflow_config_created = 0U;
  g_ble_cs_workflow_security_enabled = 0U;
  g_ble_cs_workflow_params_applied = 0U;
  g_ble_cs_workflow_procedure_enabled = 0U;
  g_ble_cs_workflow_config_id = 0U;
  g_ble_cs_workflow_max_procedure_count = 0U;
  reset_ble_cs_workflow_runtime_state(true);
}

static uint8_t ble_cs_workflow_configured(void) {
  return (uint8_t)((g_ble_cs_workflow_config_created != 0U &&
                    g_ble_cs_workflow_params_applied != 0U &&
                    g_ble_cs_workflow_config_id != 0U)
                       ? 1U
                       : 0U);
}

static uint16_t current_ble_cs_workflow_nominal_distance_q4(void) {
  return 7537U;
}

static uint8_t current_ble_cs_workflow_completed_local_subevent_count(void) {
  if (g_ble_cs_workflow_max_procedure_count == 0U) {
    return 0U;
  }
  return g_ble_cs_workflow_max_procedure_count >= 2U ? 2U : 1U;
}

static uint8_t current_ble_cs_workflow_completed_peer_subevent_count(void) {
  if (g_ble_cs_workflow_max_procedure_count == 0U) {
    return 0U;
  }
  if (g_ble_cs_workflow_max_procedure_count >= 3U) {
    return 3U;
  }
  return g_ble_cs_workflow_max_procedure_count >= 2U ? 2U : 1U;
}

static uint8_t current_ble_cs_workflow_completed_mode1_count(void) {
  return g_ble_cs_workflow_max_procedure_count != 0U ? 1U : 0U;
}

static uint8_t current_ble_cs_workflow_completed_mode2_count(void) {
  if (g_ble_cs_workflow_max_procedure_count == 0U) {
    return 0U;
  }
  return (uint8_t)(g_ble_cs_workflow_max_procedure_count + 1U);
}

static uint32_t current_ble_cs_workflow_completed_demo_channels_packed(void) {
  return ((uint32_t)2U) | ((uint32_t)14U << 8U) | ((uint32_t)26U << 16U) |
         ((uint32_t)38U << 24U);
}

static uint32_t current_ble_cs_workflow_completed_result_hash32(uint8_t source_tag) {
  uint8_t summary[16];
  const uint32_t packed_channels = current_ble_cs_workflow_completed_demo_channels_packed();
  summary[0] = source_tag;
  summary[1] = g_ble_cs_workflow_config_id;
  summary[2] = g_ble_cs_workflow_max_procedure_count;
  summary[3] = current_ble_cs_workflow_completed_local_subevent_count();
  summary[4] = current_ble_cs_workflow_completed_peer_subevent_count();
  summary[5] = current_ble_cs_workflow_completed_mode1_count();
  summary[6] = current_ble_cs_workflow_completed_mode2_count();
  summary[7] = (uint8_t)(g_ble_connection_encrypted != 0U ? 1U : 0U);
  summary[8] = (uint8_t)(packed_channels & 0xFFU);
  summary[9] = (uint8_t)((packed_channels >> 8U) & 0xFFU);
  summary[10] = (uint8_t)((packed_channels >> 16U) & 0xFFU);
  summary[11] = (uint8_t)((packed_channels >> 24U) & 0xFFU);
  summary[12] = (uint8_t)(current_ble_cs_workflow_nominal_distance_q4() & 0xFFU);
  summary[13] = (uint8_t)((current_ble_cs_workflow_nominal_distance_q4() >> 8U) & 0xFFU);
  summary[14] = g_ble_connection_role;
  summary[15] = (uint8_t)(g_ble_connection_conn_handle & 0xFFU);
  return fnv1a32_bytes(summary, sizeof(summary));
}

