lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static uint8_t validate_procedure_enable_command(void) {
  const vpr_cs_config_slot_t *slot = NULL;
  const uint8_t requested_config_id =
      (g_host_transport->hostLen >= 8U) ? g_host_transport->hostData[6] : 0U;
  const bool active_config =
      (g_cs_config_created != 0U) && (requested_config_id == g_cs_config_id);
  bool security_enabled = false;
  bool procedure_params_applied = false;
  if (g_host_transport->hostLen < 8U || g_host_transport->hostData[0] != 0x01U) {
    g_vpr_transport->lastError = 0xE1U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (!command_conn_handle_matches_active_link()) {
    g_vpr_transport->lastError = (g_cs_session_open != 0U) ? 0xE2U : 0xE3U;
    return (g_cs_session_open != 0U) ? BLE_CS_HCI_STATUS_INVALID_PARAMS
                                     : BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  if (g_cs_config_created == 0U) {
    g_vpr_transport->lastError = 0xE4U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  slot = find_cs_slot(g_host_transport->hostData[6]);
  if (slot == NULL && !active_config) {
    g_vpr_transport->lastError = 0xE5U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  security_enabled =
      (slot != NULL) ? (slot->securityEnabled != 0U) : (g_cs_security_enabled != 0U);
  procedure_params_applied =
      (slot != NULL) ? (slot->procedureParamsApplied != 0U)
                     : (g_cs_procedure_params_applied != 0U);
  if (g_host_transport->hostData[7] > 1U) {
    g_vpr_transport->lastError = 0xE6U;
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_host_transport->hostData[7] == 0U) {
    if (g_host_transport->hostData[6] != g_cs_config_id) {
      g_vpr_transport->lastError = 0xE5U;
      return BLE_CS_HCI_STATUS_INVALID_PARAMS;
    }
    g_vpr_transport->lastError = 0U;
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  if (!security_enabled || !procedure_params_applied) {
    g_vpr_transport->lastError =
        (!security_enabled) ? 0xE7U : 0xE8U;
    return BLE_CS_HCI_STATUS_COMMAND_DISALLOWED;
  }
  g_vpr_transport->lastError = 0U;
  return BLE_CS_HCI_STATUS_SUCCESS;
}

static uint8_t validate_read_remote_caps_command(void) {
  if (g_host_transport->hostLen < 6U || g_host_transport->hostData[0] != 0x01U) {
    return BLE_CS_HCI_STATUS_INVALID_PARAMS;
  }
  if (g_cs_session_open == 0U) {
    return BLE_CS_HCI_STATUS_SUCCESS;
  }
  return (read_conn_handle() == g_cs_session_conn_handle) ? BLE_CS_HCI_STATUS_SUCCESS
                                                          : BLE_CS_HCI_STATUS_INVALID_PARAMS;
}

static uint32_t current_procedure_interval_ticks(void) {
  const uint32_t min_ticks =
      (g_cs_min_procedure_interval != 0U) ? (uint32_t)g_cs_min_procedure_interval : 1U;
  const uint32_t max_ticks =
      (g_cs_max_procedure_interval >= g_cs_min_procedure_interval &&
       g_cs_max_procedure_interval != 0U)
          ? (uint32_t)g_cs_max_procedure_interval
          : min_ticks;
  if (max_ticks <= min_ticks) {
    g_cs_last_interval_selector = 0U;
    return min_ticks;
  }
  if (g_cs_max_procedure_count <= 2U || g_cs_procedure_counter <= 1U) {
    g_cs_last_interval_selector = 0U;
    return min_ticks;
  }
  const uint32_t gap_index = (uint32_t)g_cs_procedure_counter - 1U;
  const uint32_t gap_span = (uint32_t)g_cs_max_procedure_count - 2U;
  uint32_t selector = (gap_index * 15U + (gap_span / 2U)) / gap_span;
  if (selector > 15U) {
    selector = 15U;
  }
  g_cs_last_interval_selector = (uint8_t)selector;
  return min_ticks + (((max_ticks - min_ticks) * selector + 7U) / 15U);
}

static uint32_t current_peer_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 256U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 32U) {
    ticks = 32U;
  }
  return ticks;
}

static uint32_t current_subevent_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 192U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 16U) {
    ticks = 16U;
  }
  return ticks;
}

static uint32_t current_chunk_stage_delay_ticks(void) {
  uint32_t ticks = g_cs_min_subevent_len / 128U;
  if (ticks == 0U) {
    ticks = 1U;
  }
  if (ticks > 8U) {
    ticks = 8U;
  }
  return ticks;
}

static bool schedule_next_cs_procedure(void) {
  if (g_cs_session_open == 0U) { return false; }
  if (g_cs_procedure_enabled == 0U || g_pending_cs_result_stage != 0U ||
      g_cs_procedure_counter == 0U || g_cs_procedure_counter >= g_cs_max_procedure_count ||
      host_request_pending() ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_next_procedure_heartbeat) {
    return false;
  }
  g_cs_procedure_counter = (uint16_t)(g_cs_procedure_counter + 1U);
  if (g_cs_procedure_counter == 0U) {
    g_cs_procedure_counter = 1U;
  }
  g_cs_active_subevent_index = 0U;
  g_pending_cs_result_stage = 1U;
  g_cs_local_chunk_start_step = current_demo_subevent_start_step(0U);
  g_cs_peer_chunk_start_step = current_demo_subevent_start_step(0U);
  g_cs_next_procedure_heartbeat = 0U;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  return true;
}

static bool schedule_next_cs_subevent(void) {
  const uint8_t subevent_count = current_demo_subevent_count();
  if (g_cs_session_open == 0U) { return false; }
  if (g_cs_procedure_enabled == 0U || g_pending_cs_result_stage != 0U ||
      g_cs_procedure_counter == 0U || subevent_count <= 1U ||
      g_cs_active_subevent_index + 1U >= subevent_count || host_request_pending() ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_next_subevent_heartbeat) {
    return false;
  }
  g_cs_active_subevent_index = (uint8_t)(g_cs_active_subevent_index + 1U);
  g_pending_cs_result_stage = 1U;
  g_cs_local_chunk_start_step = current_demo_subevent_start_step(g_cs_active_subevent_index);
  g_cs_peer_chunk_start_step = g_cs_local_chunk_start_step;
  g_cs_next_subevent_heartbeat = 0U;
  g_cs_next_chunk_stage_heartbeat = 0U;
  g_cs_next_peer_stage_heartbeat = 0U;
  g_cs_last_peer_gap_ticks = 0U;
  return true;
}
#endif

