lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
#if !VPR_CS_DEDICATED_IMAGE
static uint16_t current_channel_selection_group(void) { return 0U; }

static uint16_t current_step_count_group(void) { return 0U; }

static uint8_t current_ble_cs_workflow_completed_total_step_count(void) {
  return (uint8_t)(current_ble_cs_workflow_completed_mode1_count() +
                   current_ble_cs_workflow_completed_mode2_count());
}

static uint8_t current_ble_cs_workflow_completed_channel(uint8_t phase_step_index) {
  const uint32_t packed_channels = current_ble_cs_workflow_completed_demo_channels_packed();
  const uint8_t slot = (uint8_t)(phase_step_index & 0x03U);
  return (uint8_t)((packed_channels >> (slot * 8U)) & 0xFFU);
}

static size_t append_generic_ble_cs_local_result_step(uint8_t *dst, uint8_t step_index) {
  if (dst == NULL) {
    return 0U;
  }
  if (current_ble_cs_workflow_completed_mode1_count() != 0U && step_index == 0U) {
    return append_mode1_unavailable_step(dst, current_ble_cs_workflow_completed_channel(0U), 1U);
  }
  {
    const uint8_t phase_step_index =
        (uint8_t)(step_index - (current_ble_cs_workflow_completed_mode1_count() != 0U ? 1U : 0U));
    append_mode2_sample_step(dst, current_ble_cs_workflow_completed_channel(phase_step_index),
                             current_demo_antenna_permutation(phase_step_index),
                             ((phase_step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                                 : VPR_CS_TONE_QUALITY_HIGH,
                             k_local_demo_pct_sample);
  }
  return 8U;
}

static size_t append_generic_ble_cs_peer_result_step(uint8_t *dst, uint8_t step_index) {
  if (dst == NULL) {
    return 0U;
  }
  if (current_ble_cs_workflow_completed_mode1_count() != 0U && step_index == 0U) {
    return append_mode1_unavailable_step(dst, current_ble_cs_workflow_completed_channel(0U), 1U);
  }
  {
    const uint8_t phase_step_index =
        (uint8_t)(step_index - (current_ble_cs_workflow_completed_mode1_count() != 0U ? 1U : 0U));
    const uint8_t channel = current_ble_cs_workflow_completed_channel(phase_step_index);
    append_mode2_sample_step(dst, channel, current_demo_antenna_permutation(phase_step_index),
                             ((phase_step_index & 0x01U) != 0U) ? VPR_CS_TONE_QUALITY_MEDIUM
                                                                 : VPR_CS_TONE_QUALITY_HIGH,
                             k_generic_peer_demo_pct_sample);
  }
  return 8U;
}

static uint16_t build_ble_cs_workflow_completed_result_payload(uint8_t *dst, size_t max_len,
                                                               bool peer_side) {
  const uint8_t total_steps = current_ble_cs_workflow_completed_total_step_count();
  size_t offset = 0U;
  if (dst == NULL || max_len < 15U || total_steps == 0U ||
      g_ble_cs_workflow_completed_config_id == 0U ||
      g_ble_cs_workflow_completed_procedure_count == 0U) {
    return 0U;
  }

  bytes_zero(dst, max_len);
  write_le16(&dst[0], g_ble_connection_conn_handle);
  dst[2] = g_ble_cs_workflow_completed_config_id;
  write_le16(&dst[3], 0x1200U);
  write_le16(&dst[5], g_ble_cs_workflow_completed_procedure_count);
  write_le16(&dst[7], 0x0010U);
  dst[9] = (uint8_t)(int8_t)-13;
  dst[10] = 0x00U;
  dst[11] = 0x00U;
  dst[12] = 0x00U;
  dst[13] = 1U;
  dst[14] = total_steps;
  offset = 15U;

  for (uint8_t step_index = 0U; step_index < total_steps; ++step_index) {
    const size_t step_len =
        peer_side ? append_generic_ble_cs_peer_result_step(&dst[offset], step_index)
                  : append_generic_ble_cs_local_result_step(&dst[offset], step_index);
    if (step_len == 0U || (offset + step_len) > max_len) {
      return 0U;
    }
    offset += step_len;
  }
  return (uint16_t)offset;
}

static void cache_ble_cs_workflow_completed_results(void) {
  g_ble_cs_workflow_completed_local_payload_len = build_ble_cs_workflow_completed_result_payload(
      g_ble_cs_workflow_completed_local_payload, sizeof(g_ble_cs_workflow_completed_local_payload),
      false);
  g_ble_cs_workflow_completed_peer_payload_len = build_ble_cs_workflow_completed_result_payload(
      g_ble_cs_workflow_completed_peer_payload, sizeof(g_ble_cs_workflow_completed_peer_payload),
      true);
  g_ble_cs_workflow_completed_local_hash32 =
      fnv1a32_bytes(g_ble_cs_workflow_completed_local_payload,
                    g_ble_cs_workflow_completed_local_payload_len);
  g_ble_cs_workflow_completed_peer_hash32 =
      fnv1a32_bytes(g_ble_cs_workflow_completed_peer_payload,
                    g_ble_cs_workflow_completed_peer_payload_len);
}

static size_t append_local_demo_step(uint8_t *dst, const uint8_t *channels,
                                     uint8_t step_index) {
  if (dst == NULL || channels == NULL) {
    return 0U;
  }
  append_mode2_demo_step(dst, channels[step_index & 0x03U], step_index);
  return 8U;
}
#endif

static size_t build_remote_caps_payload(uint8_t *payload, size_t max_len, uint16_t conn_handle) {
  if (payload == NULL || max_len < 34U) {
    return 0U;
  }
  bytes_zero(payload, 34U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = 4U;
  write_le16(&payload[4], 6U);
  payload[6] = 4U;
  payload[7] = 4U;
  payload[8] = 0x03U;
  payload[9] = 0x01U;
  payload[10] = 0x07U;
  payload[11] = 0x02U;
  payload[12] = 0x03U;
  payload[13] = 0x04U;
  write_le16(&payload[14], 0x0001U);
  write_le16(&payload[16], 0x0001U);
  payload[18] = 0x06U;
  write_le16(&payload[19], 0x001EU);
  write_le16(&payload[21], 10U);
  write_le16(&payload[23], 20U);
  write_le16(&payload[25], 30U);
  write_le16(&payload[27], 40U);
  payload[29] = 3U;
  payload[30] = 4U;
  write_le16(&payload[31], 50U);
  payload[33] = 6U;
  return 34U;
}

static size_t build_remote_fae_payload(uint8_t *payload, size_t max_len,
                                       uint16_t conn_handle, uint8_t status) {
  if (payload == NULL || max_len < (3U + BLE_CS_FAE_TABLE_LEN)) {
    return 0U;
  }
  payload[0] = status;
  write_le16(&payload[1], conn_handle);
  bytes_zero(&payload[3], BLE_CS_FAE_TABLE_LEN);
  return 3U + BLE_CS_FAE_TABLE_LEN;
}

static size_t build_security_complete_payload(uint8_t *payload, size_t max_len,
                                              uint16_t conn_handle) {
  if (payload == NULL || max_len < 3U) {
    return 0U;
  }
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  return 3U;
}

static size_t build_config_complete_payload(uint8_t *payload, size_t max_len,
                                            uint16_t conn_handle) {
  static const uint8_t k_default_channel_map[10] = {0xFFU, 0xFFU, 0xFFU, 0xFFU, 0x1FU,
                                                    0x00U, 0x00U, 0x00U, 0x00U, 0x00U};
  if (payload == NULL || max_len < 33U) {
    return 0U;
  }
  bytes_zero(payload, 33U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
  payload[5] = g_cs_main_mode_type;
  payload[6] = g_cs_sub_mode_type;
  payload[7] = g_cs_min_main_mode_steps;
  payload[8] = g_cs_max_main_mode_steps;
  payload[9] = g_cs_main_mode_repetition;
  payload[10] = g_cs_mode0_steps;
  payload[11] = g_cs_role;
  payload[12] = g_cs_rtt_type;
  payload[13] = g_cs_cs_sync_phy;
  bytes_copy(&payload[14], g_cs_channel_map, sizeof(g_cs_channel_map));
  payload[24] = g_cs_channel_map_repetition;
  payload[25] = g_cs_channel_selection_type;
  payload[26] = g_cs_ch3c_shape;
  payload[27] = g_cs_ch3c_jump;
  payload[28] = g_cs_enhancements1;
#else
  payload[3] = 1U;
  payload[5] = BLE_CS_MAIN_MODE2;
  payload[6] = 0xFFU;
  payload[7] = 3U;
  payload[8] = 5U;
  payload[9] = 1U;
  payload[10] = 1U;
  payload[11] = 0U;
  payload[12] = 1U;
  payload[13] = 2U;
  bytes_copy(&payload[14], k_default_channel_map, sizeof(k_default_channel_map));
  payload[24] = 1U;
  payload[25] = 1U;
  payload[26] = 1U;
  payload[27] = 3U;
  payload[28] = 0x01U;
#endif
  payload[4] = 1U;
  payload[29] = 10U;
  payload[30] = 20U;
  payload[31] = 30U;
  payload[32] = 40U;
  return 33U;
}

static size_t build_remove_config_complete_payload(uint8_t *payload, size_t max_len,
                                                   uint16_t conn_handle, uint8_t config_id) {
  if (payload == NULL || max_len < 33U) {
    return 0U;
  }
  bytes_zero(payload, 33U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
  payload[3] = config_id;
  payload[4] = 0U;
  return 33U;
}

static size_t build_procedure_enable_complete_payload(uint8_t *payload, size_t max_len,
                                                      uint16_t conn_handle) {
  if (payload == NULL || max_len < 21U) {
    return 0U;
  }
  bytes_zero(payload, 21U);
  payload[0] = 0U;
  write_le16(&payload[1], conn_handle);
#if VPR_CS_DEDICATED_IMAGE
  payload[3] = g_cs_config_id;
  payload[5] = g_cs_tone_antenna_config_selection;
  payload[6] = (uint8_t)g_cs_tx_power_delta;
  write_le24(&payload[7], g_cs_min_subevent_len);
  payload[10] = 4U;
  write_le16(&payload[11], g_cs_min_procedure_interval);
  write_le16(&payload[13], g_cs_max_procedure_interval);
  write_le16(&payload[15], g_cs_max_procedure_interval);
  write_le16(&payload[17], g_cs_max_procedure_count);
  write_le16(&payload[19], g_cs_max_procedure_len);
#else
  payload[3] = 1U;
  payload[5] = 2U;
  payload[6] = (uint8_t)(int8_t)-12;
  write_le24(&payload[7], 0x000456UL);
  payload[10] = 4U;
  write_le16(&payload[11], 100U);
  write_le16(&payload[13], 200U);
  write_le16(&payload[15], 300U);
  write_le16(&payload[17], 8U);
  write_le16(&payload[19], 12U);
#endif
  payload[4] =
#if VPR_CS_DEDICATED_IMAGE
      g_cs_procedure_enabled;
#else
      1U;
#endif
  return 21U;
}

static size_t build_demo_subevent_payload(uint8_t *payload, size_t max_len,
                                          uint16_t conn_handle, bool peer_side,
                                          bool continuation, uint8_t start_step_index,
                                          uint8_t *steps_built_out,
                                          bool *has_more_out) {
  if (payload == NULL || steps_built_out == NULL || has_more_out == NULL) {
    return 0U;
  }
  const size_t header_len = continuation ? 8U : 15U;
  if (max_len < (header_len + 8U)) {
    return 0U;
  }

  uint8_t channels[6];
  uint8_t step_count = 4U;
  uint8_t total_steps = 4U;
  uint8_t subevent_index = 0U;
  uint8_t subevent_count = 1U;
  uint8_t subevent_start_step = 0U;
  uint8_t subevent_step_count = 4U;
  uint8_t subevent_end_step = 4U;
  uint8_t chunk_steps = 0U;
  bool has_more = false;
  bool procedure_partial = false;
  bool subevent_partial = false;
#if VPR_CS_DEDICATED_IMAGE
  step_count = current_demo_step_count();
  if (step_count == 0U) {
    step_count = 1U;
  }
  total_steps = current_demo_total_step_count();
  subevent_count = current_demo_subevent_count();
  subevent_index = g_cs_active_subevent_index;
  if (subevent_index >= subevent_count) {
    return 0U;
  }
  subevent_start_step = current_demo_subevent_start_step(subevent_index);
  subevent_step_count = current_demo_subevent_step_count(subevent_index);
  subevent_end_step = (uint8_t)(subevent_start_step + subevent_step_count);
  if (start_step_index < subevent_start_step || start_step_index >= subevent_end_step ||
      start_step_index >= total_steps) {
    return 0U;
  }
  size_t budget =
      continuation ? current_demo_continue_chunk_budget(subevent_index, start_step_index)
                   : current_demo_initial_chunk_budget(subevent_index);
  const size_t payload_budget = max_len - header_len;
  if (budget > payload_budget) {
    budget = payload_budget;
  }
  chunk_steps = count_demo_steps_for_budget(budget, start_step_index, subevent_end_step);
  if (chunk_steps == 0U) {
    return 0U;
  }
  has_more = ((uint8_t)(start_step_index + chunk_steps) < subevent_end_step);
  subevent_partial = has_more;
  procedure_partial =
      has_more || ((uint8_t)(subevent_index + 1U) < subevent_count);
  fill_demo_channels_for_procedure(channels, step_count);
#else
  const uint32_t packed_channels = g_host_transport->reserved;
  channels[0] = (uint8_t)(packed_channels & 0xFFU);
  channels[1] = (uint8_t)((packed_channels >> 8U) & 0xFFU);
  channels[2] = (uint8_t)((packed_channels >> 16U) & 0xFFU);
  channels[3] = (uint8_t)((packed_channels >> 24U) & 0xFFU);
  if (start_step_index != 0U) {
    return 0U;
  }
  chunk_steps = 4U;
  has_more = continuation;
  subevent_partial = has_more;
  procedure_partial = has_more;
#endif

  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
  payload[2] =
#if VPR_CS_DEDICATED_IMAGE
      g_cs_config_id;
#else
      1U;
#endif
  if (!continuation) {
    write_le16(&payload[3],
#if VPR_CS_DEDICATED_IMAGE
               current_demo_acl_event_counter());
#else
               0x1234U);
#endif
    write_le16(&payload[5],
#if VPR_CS_DEDICATED_IMAGE
               g_cs_procedure_counter);
#else
               7U);
#endif
    write_le16(&payload[7],
#if VPR_CS_DEDICATED_IMAGE
               current_demo_frequency_compensation());
#else
               0U);
#endif
    payload[9] =
#if VPR_CS_DEDICATED_IMAGE
        (uint8_t)current_demo_reference_power_dbm();
#else
        0U;
#endif
#if VPR_CS_DEDICATED_IMAGE
    if (g_cs_procedure_abort_reason != 0U) {
      payload[10] = BLE_CS_PROCEDURE_DONE_ABORTED;
      payload[11] = BLE_CS_SUBEVENT_DONE_ABORTED;
      payload[12] = g_cs_procedure_abort_reason;
    } else
#endif
    {
      payload[10] = procedure_partial ? 0x01U : 0x00U;
      payload[11] = subevent_partial ? 0x01U : 0x00U;
      payload[12] = 0U;
    }
    payload[13] =
#if VPR_CS_DEDICATED_IMAGE
        current_demo_num_antenna_paths();
#else
        2U;
#endif
    payload[14] = chunk_steps;
  } else {
#if VPR_CS_DEDICATED_IMAGE
    if (g_cs_subevent_abort_reason != 0U) {
      payload[3] = BLE_CS_PROCEDURE_DONE_ABORTED;
      payload[4] = BLE_CS_SUBEVENT_DONE_ABORTED;
      payload[5] = g_cs_subevent_abort_reason;
    } else
#endif
    {
      payload[3] = procedure_partial ? 0x01U : 0x00U;
      payload[4] = subevent_partial ? 0x01U : 0x00U;
      payload[5] = 0U;
    }
    payload[6] =
#if VPR_CS_DEDICATED_IMAGE
        current_demo_num_antenna_paths();
#else
        2U;
#endif
    payload[7] = chunk_steps;
  }

  size_t offset = header_len;
  for (uint8_t i = 0U; i < chunk_steps; ++i) {
    const uint8_t step_index = (uint8_t)(start_step_index + i);
    if (peer_side) {
#if VPR_CS_DEDICATED_IMAGE
      offset += append_peer_demo_step(&payload[offset], channels, step_index);
#else
      return 0U;
#endif
    } else {
      offset += append_local_demo_step(&payload[offset], channels, step_index);
    }
  }

  *steps_built_out = chunk_steps;
  *has_more_out = has_more;
  return offset;
}

