lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
static void publish_response_for_opcode(uint16_t opcode) {
  const uint32_t count =
      (g_host_transport->scriptCount <= NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT)
          ? g_host_transport->scriptCount
          : NRF54L15_VPR_TRANSPORT_MAX_SCRIPT_COUNT;

  g_vpr_transport->lastOpcode = (uint32_t)opcode;
  for (uint32_t i = 0U; i < count; ++i) {
    volatile const Nrf54l15VprTransportScript* script = &g_host_transport->scripts[i];
    if (script->opcode != opcode) {
      continue;
    }

    if (script->responseLen > NRF54L15_VPR_TRANSPORT_MAX_VPR_DATA) {
      g_vpr_transport->lastError = 2U;
      g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_ERROR;
      g_vpr_transport->vprLen = 0U;
      return;
    }

    zero_vpr_data();
    bytes_copy((void *)g_vpr_transport->vprData, (const void *)script->response,
               script->responseLen);
    g_vpr_transport->vprLen = script->responseLen;
    return;
  }

  if (!publish_builtin_response_for_opcode(opcode)) {
    build_unknown_command_response(opcode);
  }
}

#if VPR_CS_DEDICATED_IMAGE
static size_t build_test_subevent_payload(uint8_t *payload, size_t max_len,
                                          uint16_t conn_handle, bool continuation,
                                          uint16_t procedure_counter) {
  /* Build a synthetic CS subevent result for test mode.
   * Uses minimal header + 4 mode-2 step entries (RTT only, no phase).
   * Initial (0x31): 15-byte header + 4*8=32 bytes step data = 47 bytes.
   * Continue (0x32): 8-byte header + 4*8=32 bytes step data = 40 bytes.
   * Both fit in 40-byte payload buffer. */
  if (payload == NULL || max_len < 40U) {
    return 0U;
  }

  bytes_zero(payload, max_len);
  write_le16(&payload[0], conn_handle);
  payload[2] = BLE_CS_HCI_TEST_CONFIG_ID;  /* config_id = 0 for test mode */

  if (!continuation) {
    /* Initial subevent result (0x31) — 15-byte header. */
    write_le16(&payload[3], 0U);           /* start_acl_conn_event = 0 */
    write_le16(&payload[5], procedure_counter); /* procedure_counter */
    write_le16(&payload[7], 0U);           /* frequency_compensation = 0 */
    payload[9] = 0U;                       /* reference_power_level = 0 */
    payload[10] = 0U;                      /* num_antenna_paths = 0 (RTT only) */
    payload[11] = 2U;                      /* main_mode_type = 2 (RTT+PBR) */
    payload[12] = 0U;                      /* sub_mode_type = 0 */
    payload[13] = 0U;                      /* rtt_type = 0 */
    payload[14] = 0U;                      /* procedure_abort_reason = 0 */
    /* Step data starts at offset 15. */
    const size_t step_offset = 15U;
    for (uint8_t i = 0U; i < 4U; ++i) {
      payload[step_offset + i * 8U + 0U] = (uint8_t)(0x01U + i); /* channel */
      payload[step_offset + i * 8U + 1U] = 0x00U;                /* rtt_valid = 1 */
      write_le16(&payload[step_offset + i * 8U + 2U], 1000U + i * 100U); /* rtt_sample */
      payload[step_offset + i * 8U + 4U] = 0x00U;                /* phase_valid = 0 */
      payload[step_offset + i * 8U + 5U] = 0x00U;                /* tone_quality = 0 */
      payload[step_offset + i * 8U + 6U] = 0x00U;                /* antenna_path = 0 */
      payload[step_offset + i * 8U + 7U] = 0x00U;                /* rssi = 0 */
    }
    payload[14] = 0x01U;  /* procedure_done_status = partial */
    return 15U + 4U * 8U;
  } else {
    /* Continue subevent result (0x32) — 8-byte header. */
    write_le16(&payload[0], conn_handle);   /* already written above, but repeat for clarity */
    payload[2] = BLE_CS_HCI_TEST_CONFIG_ID;
    write_le16(&payload[3], procedure_counter);
    payload[5] = 0U;                        /* subevent_abort_reason = 0 */
    payload[6] = 0x02U;                     /* procedure_done_status = complete */
    payload[7] = 0x00U;                     /* subevent_done_status = complete */
    /* Step data starts at offset 8. */
    const size_t step_offset = 8U;
    for (uint8_t i = 0U; i < 4U; ++i) {
      payload[step_offset + i * 8U + 0U] = (uint8_t)(0x04U + i); /* channel */
      payload[step_offset + i * 8U + 1U] = 0x00U;                /* rtt_valid = 1 */
      write_le16(&payload[step_offset + i * 8U + 2U], 2000U + i * 100U); /* rtt_sample */
      payload[step_offset + i * 8U + 4U] = 0x00U;                /* phase_valid = 0 */
      payload[step_offset + i * 8U + 5U] = 0x00U;                /* tone_quality = 0 */
      payload[step_offset + i * 8U + 6U] = 0x00U;                /* antenna_path = 0 */
      payload[step_offset + i * 8U + 7U] = 0x00U;                /* rssi = 0 */
    }
    return 8U + 4U * 8U;
  }
}

static bool publish_pending_cs_test_result_packet(void) {
  union {
    uint8_t payload[40];
    uint8_t packet[48];
  } u;
  size_t len = 0U;
  /* CS Test uses reserved handle 0x0FFF, config_id 0, ACL event counter 0. */
  const uint16_t test_handle = BLE_CS_HCI_TEST_CONN_HANDLE;
  uint8_t steps_built = 0U;
  bool has_more = false;

  if (g_cs_test_active == 0U || g_pending_cs_test_result_stage == 0U) {
    return false;
  }
  if ((g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  if (g_vpr_transport->heartbeat < g_cs_test_next_stage_heartbeat) {
    return false;
  }

  if (g_pending_cs_test_result_stage == 1U) {
    /* Initial CS Subevent Result (0x31) — partial, mode 2, 4 steps. */
    len = build_test_subevent_payload(u.payload, sizeof(u.payload), test_handle,
                                      false, g_cs_test_procedure_counter);
    if (len == 0U) return false;
    len = append_h4_le_meta(u.packet, sizeof(u.packet),
                            BLE_CS_HCI_EVT_SUBEVENT_RESULT, u.payload, len);
    if (len == 0U) return false;
    g_pending_cs_test_result_stage = 2U;
    g_cs_test_next_stage_heartbeat = g_vpr_transport->heartbeat + BLE_CS_HCI_TEST_CHUNK_DELAY_TICKS;
  } else if (g_pending_cs_test_result_stage == 2U) {
    /* Continuation CS Subevent Result Continue (0x32) — complete. */
    len = build_test_subevent_payload(u.payload, sizeof(u.payload), test_handle,
                                      true, g_cs_test_procedure_counter);
    if (len == 0U) return false;
    len = append_h4_le_meta(u.packet, sizeof(u.packet),
                            BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE, u.payload, len);
    if (len == 0U) return false;
    /* Procedure complete — schedule next or stop. */
    g_cs_test_procedure_counter = (uint16_t)(g_cs_test_procedure_counter + 1U);
    g_pending_cs_test_result_stage = 0U;
    g_cs_test_next_stage_heartbeat = g_vpr_transport->heartbeat + BLE_CS_HCI_TEST_PROCEDURE_INTERVAL_TICKS;
  } else {
    return false;
  }
  if (len == 0U) return false;
  zero_vpr_data();
  bytes_copy((void *)g_vpr_transport->vprData, u.packet, len);
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  return true;
}
#endif

static bool publish_pending_cs_result_packet(void) {
  /* payload and packet are used sequentially. union saves ~88 B stack. */
  union {
    uint8_t payload[40];
    uint8_t packet[48];
  } u;
  size_t len = 0U;
  uint16_t conn_handle = current_conn_handle();
  uint8_t steps_built = 0U;
  bool has_more = false;
#if VPR_CS_DEDICATED_IMAGE
  /* Disconnect guard: if session is closed, flush pending state. */
  if (g_cs_session_open == 0U) {
    g_pending_cs_result_stage = 0U;
    g_cs_next_chunk_stage_heartbeat = 0U;
    g_cs_next_peer_stage_heartbeat = 0U;
    g_cs_next_subevent_heartbeat = 0U;
    g_cs_next_procedure_heartbeat = 0U;
    g_cs_last_peer_gap_ticks = 0U;
    g_cs_last_interval_selector = 0U;
    return false;
  }
#endif
  if (g_pending_cs_result_stage == 0U ||
      (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) != 0U ||
      host_request_pending()) {
    return false;
  }
  if ((g_pending_cs_result_stage == 2U || g_pending_cs_result_stage == 5U) &&
      g_vpr_transport->heartbeat < g_cs_next_chunk_stage_heartbeat) {
    return false;
  }
  if (g_pending_cs_result_stage >= 3U &&
      g_vpr_transport->heartbeat < g_cs_next_peer_stage_heartbeat) {
    return false;
  }
  if (g_pending_cs_result_stage == 1U) {
    len = build_demo_subevent_payload(u.payload, sizeof(u.payload), conn_handle, false, false,
                                      g_cs_local_chunk_start_step, &steps_built, &has_more);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(u.packet, sizeof(u.packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT, u.payload, len);
  } else if (g_pending_cs_result_stage == 2U) {
    len = build_demo_subevent_payload(u.payload, sizeof(u.payload), conn_handle, false, true,
                                      g_cs_local_chunk_start_step, &steps_built, &has_more);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(u.packet, sizeof(u.packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE,
                            u.payload, len);
  } else if (g_pending_cs_result_stage == 3U) {
#if VPR_CS_DEDICATED_IMAGE
    u.payload[0] = g_cs_config_id;
    write_le16(&u.payload[1], g_cs_procedure_counter);
    len = append_h4_vendor_event(u.packet, sizeof(u.packet),
                                 VPR_VENDOR_EVENT_CS_PEER_RESULT_SOURCE, u.payload,3U);
#else
    u.payload[0] = 1U;
    len = append_h4_vendor_event(u.packet, sizeof(u.packet),
                                 VPR_VENDOR_EVENT_CS_PEER_RESULT_TRIGGER, u.payload,1U);
#endif
#if VPR_CS_DEDICATED_IMAGE
  } else if (g_pending_cs_result_stage == 4U) {
    len = build_demo_subevent_payload(u.payload, sizeof(u.payload), conn_handle, true, false,
                                      g_cs_peer_chunk_start_step, &steps_built, &has_more);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(u.packet, sizeof(u.packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT, u.payload, len);
  } else if (g_pending_cs_result_stage == 5U) {
    len = build_demo_subevent_payload(u.payload, sizeof(u.payload), conn_handle, true, true,
                                      g_cs_peer_chunk_start_step, &steps_built, &has_more);
    if (len == 0U) {
      return false;
    }
    len = append_h4_le_meta(u.packet, sizeof(u.packet), BLE_CS_HCI_EVT_SUBEVENT_RESULT_CONTINUE,
                            u.payload, len);
#endif
  } else {
    return false;
  }
  if (len == 0U) {
    return false;
  }
  zero_vpr_data();
  bytes_copy((void *)g_vpr_transport->vprData, u.packet, len);
  g_vpr_transport->vprLen = (uint32_t)len;
  g_vpr_transport->vprSeq = g_vpr_transport->vprSeq + 1U;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
#if VPR_CS_DEDICATED_IMAGE
  const uint8_t subevent_count = current_demo_subevent_count();
  const bool has_more_subevents =
      ((uint8_t)(g_cs_active_subevent_index + 1U) < subevent_count);
  const uint8_t next_subevent_start =
      current_demo_subevent_start_step((uint8_t)(g_cs_active_subevent_index + 1U));
  if (g_pending_cs_result_stage == 1U) {
    g_cs_local_chunk_start_step = (uint8_t)(g_cs_local_chunk_start_step + steps_built);
    if (has_more) {
      g_pending_cs_result_stage = 2U;
      g_cs_next_chunk_stage_heartbeat =
          g_vpr_transport->heartbeat + current_chunk_stage_delay_ticks();
    } else {
      const uint32_t peer_gap = current_peer_stage_delay_ticks();
      g_pending_cs_result_stage = 3U;
      g_cs_peer_chunk_start_step =
          current_demo_subevent_start_step(g_cs_active_subevent_index);
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + peer_gap;
      g_cs_last_peer_gap_ticks = (peer_gap > 7U) ? 7U : (uint8_t)peer_gap;
    }
  } else if (g_pending_cs_result_stage == 2U) {
    g_cs_local_chunk_start_step = (uint8_t)(g_cs_local_chunk_start_step + steps_built);
    if (has_more) {
      g_pending_cs_result_stage = 2U;
      g_cs_next_chunk_stage_heartbeat =
          g_vpr_transport->heartbeat + current_chunk_stage_delay_ticks();
    } else {
      const uint32_t peer_gap = current_peer_stage_delay_ticks();
      g_pending_cs_result_stage = 3U;
      g_cs_peer_chunk_start_step =
          current_demo_subevent_start_step(g_cs_active_subevent_index);
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + peer_gap;
      g_cs_last_peer_gap_ticks = (peer_gap > 7U) ? 7U : (uint8_t)peer_gap;
    }
  } else if (g_pending_cs_result_stage == 3U) {
    g_pending_cs_result_stage = 4U;
    g_cs_peer_chunk_start_step =
        current_demo_subevent_start_step(g_cs_active_subevent_index);
    g_cs_next_chunk_stage_heartbeat = 0U;
    g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + 1U;
  } else if (g_pending_cs_result_stage == 4U) {
    g_cs_peer_chunk_start_step = (uint8_t)(g_cs_peer_chunk_start_step + steps_built);
    if (has_more) {
      g_pending_cs_result_stage = 5U;
      g_cs_next_chunk_stage_heartbeat =
          g_vpr_transport->heartbeat + current_chunk_stage_delay_ticks();
      g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + 1U;
    } else {
      g_pending_cs_result_stage = 0U;
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = 0U;
      if (has_more_subevents) {
        g_cs_next_subevent_heartbeat =
            g_vpr_transport->heartbeat + current_subevent_stage_delay_ticks();
      } else if (g_cs_procedure_enabled != 0U &&
          g_cs_procedure_counter < g_cs_max_procedure_count) {
        g_cs_next_procedure_heartbeat =
            g_vpr_transport->heartbeat + current_procedure_interval_ticks();
      } else {
        g_cs_procedure_enabled = 0U;
        g_cs_next_procedure_heartbeat = 0U;
        g_cs_next_subevent_heartbeat = 0U;
        g_cs_last_interval_selector = 0U;
      }
    }
  } else if (g_pending_cs_result_stage == 5U) {
    g_cs_peer_chunk_start_step = (uint8_t)(g_cs_peer_chunk_start_step + steps_built);
    if (has_more) {
      g_pending_cs_result_stage = 5U;
      g_cs_next_chunk_stage_heartbeat =
          g_vpr_transport->heartbeat + current_chunk_stage_delay_ticks();
      g_cs_next_peer_stage_heartbeat = g_vpr_transport->heartbeat + 1U;
    } else if (has_more_subevents) {
      g_cs_next_subevent_heartbeat =
          g_vpr_transport->heartbeat + current_subevent_stage_delay_ticks();
      g_cs_local_chunk_start_step = next_subevent_start;
      g_cs_peer_chunk_start_step = next_subevent_start;
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = 0U;
      g_pending_cs_result_stage = 0U;
    } else if (g_cs_procedure_enabled != 0U &&
               g_cs_procedure_counter < g_cs_max_procedure_count) {
      g_cs_next_procedure_heartbeat =
          g_vpr_transport->heartbeat + current_procedure_interval_ticks();
      g_cs_next_subevent_heartbeat = 0U;
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = 0U;
      g_pending_cs_result_stage = 0U;
    } else {
      g_cs_procedure_enabled = 0U;
      g_cs_next_procedure_heartbeat = 0U;
      g_cs_next_subevent_heartbeat = 0U;
      g_cs_next_chunk_stage_heartbeat = 0U;
      g_cs_next_peer_stage_heartbeat = 0U;
      g_cs_last_interval_selector = 0U;
      g_pending_cs_result_stage = 0U;
    }
  } else {
    g_cs_next_subevent_heartbeat = 0U;
    g_cs_next_chunk_stage_heartbeat = 0U;
    g_cs_next_peer_stage_heartbeat = 0U;
    g_pending_cs_result_stage = 0U;
  }
#else
  g_pending_cs_result_stage =
      (g_pending_cs_result_stage < 3U) ? (uint8_t)(g_pending_cs_result_stage + 1U) : 0U;
#endif
  return true;
}

