lolren/NRF54L15-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/tools/vpr/vpr_cs_transport_stub.c
/* Callback for an incoming CS LL Control PDU from the peer.
 * Advances the peer-exchange state machine when the expected response
 * arrives.  In the current single-board configuration no real PDUs
 * arrive — the function is a framework placeholder wired for future
 * over-the-air exchange.  The timeout handler remains the exercised
 * path. */
static void handle_peer_cs_pdu(const uint8_t *pdu, size_t pdu_len) {
  if (pdu == NULL || pdu_len < 2U) { return; }
  const uint8_t opcode = pdu[0];
  switch (g_cs_peer_exchange_stage) {
    case VPR_CS_PEER_STAGE_AWAITING_CS_RSP:
      if (opcode == VPR_CS_LL_CS_RSP) {
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_CS_CFG;
        g_cs_peer_exchange_deadline =
            peer_deadline_for_stage(g_cs_peer_exchange_stage);
      }
      break;
    case VPR_CS_PEER_STAGE_AWAITING_CS_CFG:
      if (opcode == VPR_CS_LL_CS_CFG) {
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_PROC_RSP;
        g_cs_peer_exchange_deadline =
            peer_deadline_for_stage(g_cs_peer_exchange_stage);
      }
      break;
    case VPR_CS_PEER_STAGE_AWAITING_PROC_RSP:
      if (opcode == VPR_CS_LL_CS_PROC_RSP) {
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_SEC_RSP;
        g_cs_peer_exchange_deadline =
            peer_deadline_for_stage(g_cs_peer_exchange_stage);
      }
      break;
    case VPR_CS_PEER_STAGE_AWAITING_SEC_RSP:
      if (opcode == VPR_CS_LL_CS_SEC_RSP) {
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_AWAITING_START;
        g_cs_peer_exchange_deadline =
            peer_deadline_for_stage(g_cs_peer_exchange_stage);
      }
      break;
    case VPR_CS_PEER_STAGE_AWAITING_START:
      if (opcode == VPR_CS_LL_CS_START) {
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE;
        g_cs_peer_exchange_deadline = 0U;
      }
      break;
    case VPR_CS_PEER_STAGE_PROCEDURE_ACTIVE:
      if (opcode == VPR_CS_LL_CS_TERMINATE || opcode == VPR_CS_LL_CS_ABORT) {
        if (pdu_len >= 3U) {
          g_cs_procedure_abort_reason = pdu[2];
          g_cs_subevent_abort_reason = pdu[2];
        }
        g_cs_peer_exchange_stage = VPR_CS_PEER_STAGE_IDLE;
        g_cs_peer_exchange_deadline = 0U;
      }
      break;
    default:
      break;
  }
}
#endif  /* VPR_CS_DEDICATED_IMAGE */

static bool consume_host_request(uint32_t host_seq) {
  if (!host_request_pending()) {
    return false;
  }

  const uint16_t opcode = read_opcode();
  const uint8_t prev_test_active = g_cs_test_active;
  publish_response_for_opcode(opcode);
#if VPR_CS_DEDICATED_IMAGE
  /* After a successful LE CS Test command, initialize test staging OUTSIDE
   * the switch statement to avoid the large-switch corruption bug.
   * Detect success by checking that g_cs_test_active just flipped 0→1. */
  if (opcode == BLE_CS_HCI_OP_TEST &&
      prev_test_active == 0U && g_cs_test_active == 1U) {
    g_cs_test_procedure_counter = 1U;
    g_pending_cs_test_result_stage = 1U;
    g_cs_test_next_stage_heartbeat = g_vpr_transport->heartbeat + 50U;
  }
#endif
  g_vpr_transport->vprSeq = host_seq;
  g_vpr_transport->vprFlags = NRF54L15_VPR_TRANSPORT_FLAG_PENDING;
  g_host_transport->hostFlags = 0U;
  g_host_transport->hostLen = 0U;
  g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_READY;
  fence_rw();
  return true;
}

__attribute__((noreturn, used, externally_visible)) void vpr_main(void) {
  uint32_t last_seq = 0U;
#if !VPR_CS_DEDICATED_IMAGE
  const bool restored_from_hibernate = restore_hibernate_state();
  g_restored_from_hibernate = restored_from_hibernate ? 1U : 0U;
#endif
  const uint32_t nordic_ctrl =
      (VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Enabled
       << VPRCSR_NORDIC_VPRNORDICCTRL_NORDICKEY_Pos) |
      VPRCSR_NORDIC_VPRNORDICCTRL_ENABLERTPERIPH_Msk;

  write_vpr_nordic_ctrl(nordic_ctrl);
  fence_rw();

  g_host_transport->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  g_host_transport->version = NRF54L15_VPR_TRANSPORT_VERSION;
  g_vpr_transport->magic = NRF54L15_VPR_TRANSPORT_MAGIC;
  g_vpr_transport->version = NRF54L15_VPR_TRANSPORT_VERSION;
  g_vpr_transport->status = NRF54L15_VPR_TRANSPORT_STATUS_READY;
  g_vpr_transport->heartbeat = 0U;
  g_vpr_transport->vprFlags = 0U;
  g_vpr_transport->vprLen = 0U;
  g_vpr_transport->lastError = 0U;
  g_vpr_transport->reservedAux = 0U;
  g_vpr_transport->reservedMeta = 0U;
  g_vpr_transport->reservedConfig = 0U;
#if !VPR_CS_DEDICATED_IMAGE
  if (!restored_from_hibernate) {
    g_ticker_enabled = 0U;
    g_ticker_period_ticks = 0U;
    g_ticker_step = 1U;
    g_ticker_accum = 0U;
    g_ticker_count = 0U;
    g_ticker_event_enabled = 0U;
    g_ticker_event_emit_every = 0U;
    g_ticker_event_last_emitted_count = 0U;
    g_ticker_event_sequence = 0U;
    clear_ticker_event_queue();
    g_ticker_event_drop_count = 0U;
  }
  g_ble_legacy_adv_enabled = 0U;
  g_ble_legacy_adv_interval_ticks = 0U;
  g_ble_legacy_adv_event_count = 0U;
  g_ble_legacy_adv_next_heartbeat = 0U;
  g_ble_legacy_adv_last_random_delay_ticks = 0U;
  g_ble_legacy_adv_event_sequence = 0U;
  g_ble_legacy_adv_event_drop_count = 0U;
  g_ble_legacy_adv_channel_mask = 0x07U;
  g_ble_legacy_adv_last_channel_mask = 0U;
  g_ble_legacy_adv_next_channel_index = 0U;
  g_ble_legacy_adv_add_random_delay = 0U;
  g_ble_legacy_adv_data_len = 0U;
  bytes_zero(g_ble_legacy_adv_data, sizeof(g_ble_legacy_adv_data));
  clear_ble_legacy_adv_event_queue();
  g_ble_connection_connected = 0U;
  g_ble_connection_event_count = 0U;
  g_ble_connection_disconnect_count = 0U;
  g_ble_connection_event_sequence = 0U;
  g_ble_connection_event_drop_count = 0U;
  g_ble_connection_conn_handle = 0U;
  g_ble_connection_interval_units = 0U;
  g_ble_connection_latency = 0U;
  g_ble_connection_supervision_timeout = 0U;
  g_ble_connection_role = 0U;
  g_ble_connection_encrypted = 0U;
  g_ble_connection_tx_phy = 0U;
  g_ble_connection_rx_phy = 0U;
  g_ble_cs_link_bound = 0U;
  clear_ble_cs_workflow_state();
  g_ble_connection_last_event_flags = 0U;
  g_ble_connection_last_disconnect_reason = 0U;
  clear_ble_connection_event_queue();
  g_vpr_transport->reserved = current_ble_connection_state_packed(0U);
  g_vpr_transport->reservedAux = current_ble_connection_state_aux_packed();
  g_vpr_transport->reservedMeta = current_ble_connection_state_meta_packed();
  g_vpr_transport->reservedConfig = current_ble_connection_state_config_packed();
  g_pending_cs_result_stage = 0U;
  g_pending_hibernate = 0U;
#else
  reset_dedicated_cs_state();
  consume_ble_connection_handoff();
  g_vpr_transport->reserved = current_link_state_packed();
  g_vpr_transport->reservedAux = current_link_state_aux_packed();
  g_vpr_transport->reservedMeta = current_link_state_meta_packed();
  g_vpr_transport->reservedConfig = current_link_state_config_packed();
  g_pending_cs_result_stage = 0U;
#endif
  fence_rw();

  while (1) {
    g_vpr_transport->heartbeat = g_vpr_transport->heartbeat + 1U;
#if !VPR_CS_DEDICATED_IMAGE
    if (g_ticker_enabled != 0U && g_ticker_period_ticks != 0U) {
      g_ticker_accum = g_ticker_accum + 1U;
      if (g_ticker_accum >= g_ticker_period_ticks) {
        g_ticker_accum = 0U;
        g_ticker_count = g_ticker_count + g_ticker_step;
        if (g_ticker_event_enabled != 0U && g_ticker_event_emit_every != 0U &&
            g_ticker_count >= (g_ticker_event_last_emitted_count + g_ticker_event_emit_every)) {
          (void)enqueue_ticker_event(g_ticker_count, g_ticker_step, g_vpr_transport->heartbeat);
        }
      }
    }
    if (g_ble_legacy_adv_enabled != 0U && g_ble_legacy_adv_interval_ticks != 0U &&
        g_vpr_transport->heartbeat >= g_ble_legacy_adv_next_heartbeat) {
      const uint8_t channel_mask =
          pick_next_ble_legacy_adv_channel(g_ble_legacy_adv_channel_mask);
      const uint32_t random_delay_ticks =
          ble_legacy_adv_random_delay_ticks(g_vpr_transport->heartbeat,
                                            g_ble_legacy_adv_event_count + 1U,
                                            g_ble_legacy_adv_interval_ticks);
      g_ble_legacy_adv_last_channel_mask = channel_mask;
      g_ble_legacy_adv_last_random_delay_ticks = random_delay_ticks;
      g_ble_legacy_adv_event_count = g_ble_legacy_adv_event_count + 1U;
      g_ble_legacy_adv_next_heartbeat =
          g_vpr_transport->heartbeat + g_ble_legacy_adv_interval_ticks +
          random_delay_ticks;
      (void)enqueue_ble_legacy_adv_event(channel_mask, g_ble_legacy_adv_event_count,
                                         g_vpr_transport->heartbeat,
                                         random_delay_ticks);
    }
    service_ble_cs_workflow_runtime();
#endif
    fence_rw();

    const uint32_t host_seq = g_host_transport->hostSeq;
    const uint32_t host_flags = g_host_transport->hostFlags;
#if !VPR_CS_DEDICATED_IMAGE
    g_vpr_transport->reserved = current_ble_connection_state_packed(host_flags);
    g_vpr_transport->reservedAux = current_ble_connection_state_aux_packed();
    g_vpr_transport->reservedMeta = current_ble_connection_state_meta_packed();
    g_vpr_transport->reservedConfig = current_ble_connection_state_config_packed();
#else
    (void)host_flags;
    g_vpr_transport->reserved = current_link_state_packed();
    g_vpr_transport->reservedAux = current_link_state_aux_packed();
    g_vpr_transport->reservedMeta = current_link_state_meta_packed();
    g_vpr_transport->reservedConfig = current_link_state_config_packed();
#endif
    fence_rw();

#if VPR_CS_DEDICATED_IMAGE
    detect_and_handle_disconnect();
    check_peer_exchange_timeout();
#endif

    if ((host_seq != last_seq) && host_request_pending()) {
      if (consume_host_request(host_seq)) {
        last_seq = host_seq;
      }
    }

    if ((g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U &&
        !host_request_pending()) {
#if !VPR_CS_DEDICATED_IMAGE
      if (!publish_pending_cs_result_packet()) {
        if (!publish_pending_ticker_event()) {
          if (!publish_pending_ble_legacy_adv_event()) {
            (void)publish_pending_ble_connection_event();
          }
        }
      }
#else
      /* CS Test stream has priority over connected-path results. */
      (void)publish_pending_cs_test_result_packet();
      if (!schedule_next_cs_subevent()) {
        (void)schedule_next_cs_procedure();
      }
      (void)publish_pending_cs_result_packet();
#endif
    }

#if !VPR_CS_DEDICATED_IMAGE
    if (g_pending_hibernate != 0U &&
        (g_vpr_transport->vprFlags & NRF54L15_VPR_TRANSPORT_FLAG_PENDING) == 0U) {
      g_pending_hibernate = 0U;
      fence_rw();
      write_vpr_sleepctrl(VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_SLEEPSTATE_HIBERNATE |
                          VPRCSR_NORDIC_VPRNORDICSLEEPCTRL_STACKONSLEEP_Msk);
      fence_rw();
      /* Nordic documents that VPR wake can fail if WFI is entered with MIE clear. */
      enable_machine_interrupts();
      __asm__ volatile("wfi");
    }
#endif
  }
}

__attribute__((naked, noreturn, section(".text.start"))) void _start(void) {
  __asm__ volatile(
      "li gp, 0\n"
      "la sp, __stack_top\n"
      "j vpr_main\n");
}
